# ExecutedEventArgs Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExecutedEventArgs Methods
ExecutedEventArgs Class See Also
---
The ExecutedEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetJournalData | Gets the journal data associated to this command (on journal playback). |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetJournalData | Sets the journal data associated to this command (on journal playback). |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace